inaciose/ackerbot_esp32/src/main.cpp
		encoderLeftPulsesTargetStart = 0;
		encoderLeftPulsesTarget = 0;
		encoderLeftPulsesOnTarget = false;
		encoderPulsesTargetEnabled = false;
		}
	}
	
  	// set speed  
	// if(setPwmStatus) {    
	// 	leftMotorPwmOut = leftMotorPwmOutCmd;
	//  setPwmStatus = false;
	// } else {
    leftMotorPwmOut = 0;
    if(leftSpeedPidSetPoint != 0) {
      leftMotorPwmOut = leftSpeedPidOutput * leftSpeedPidSetPointDirection; // - steeringPidOutput;
    }
	//
	//  }

  	update_PID();
  	bodyMotorsControl();

	// speed calculation m/s, on second
	if(millis() >= secondTimer) {
		secondTimer = millis() + 1000;
		speedOs = (encoderLeftPulses - speedOsLastPulses) * mpp;
		speedOsLastPulses = encoderLeftPulses;
	}

	if(millis() >= loopInfoTimer) {
		loopInfoTimer = millis() + 100;
		
		Serial.print(twist_angular);
		Serial.print("\t");
		Serial.print(steering_angle);
		Serial.print("\t");
		Serial.print(servo1Angle);
		Serial.print(" | \t");
		Serial.print(twist_linear);
		Serial.print("\t");
		Serial.print(velocity_target);
		Serial.print(" | \t");
		Serial.print(speedOs);
		Serial.print("\t");
		Serial.print(speed);
		Serial.print("\t");
		Serial.print(leftSpeedPidSetPoint, 0);
		Serial.print("\t");
		Serial.print(leftSpeedPidInputLast);
		Serial.print("\t");
		Serial.print(encoderLeftPulses);
		Serial.print("\t");
		Serial.print(leftMotorPwmOut);
		Serial.print("\t");
		Serial.println(motorState);
		
	}

  #ifdef ENABLE_GPS
    while (Serial2.available() > 0)
      if (gps.encode(Serial2.read())) {
        if (gps.location.isValid()) {
          gps_lat = gps.location.lat();
          gps_lng = gps.location.lng();
          Serial.print(gps_lat, 6);
          Serial.print(F(","));
          Serial.println(gps_lng, 6);
        } else {
          Serial.println(F("gps invalid, wait for sattelites"));
        }        
      }

    if (millis() > 5000 && gps.charsProcessed() < 10) {
      Serial.println(F("No GPS detected: check wiring."));
      while(true);
    }
  #endif

  #ifdef ENABLE_MPU6050    
    mpuDMP();
  #endif

  if ( digitalRead(BUTTON1_PIN) == HIGH ) { 
    Serial.println("button1_state = HIGH");
  }
  if ( digitalRead(BUTTON2_PIN) == HIGH ) { 
    Serial.println("button2_state = HIGH");
  }
  if ( digitalRead(BUTTON3_PIN) == HIGH ) { 
    Serial.println("button3_state = HIGH");
  }

	// publish
	encoderPub();
	gpsPub();

  blinkLedBuiltin();

  nh.spinOnce();
}